app/controllers/api/v1/artists_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at", "approved") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Rammstein"], ["created_at", "2022-05-15 12:04:44.083505"], ["updated_at", "2022-05-15 12:04:44.083505"], ["approved", false]]
---
      def create
        @artist = Artist.new(artist_params)

        if @artist.save

UPDATE "artists" SET "name" = ?, "updated_at" = ?, "approved" = ? WHERE "artists"."id" = ?  [["name", "fsdfsffs"], ["updated_at", "2022-05-10 19:30:57.822035"], ["approved", 1], ["id", 4]]
---
      def update
        if @artist.update(artist_params)