app/controllers/api/v1/records_controller.rb

SELECT "records".* FROM "records" WHERE "records"."user_id" = ?  [["user_id", 3]]
---
      def index
        @records = current_user.records.all

INSERT INTO "records" ("title", "year", "artist_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "RTFERF"], ["year", "EFRFER"], ["artist_id", 4], ["user_id", 3], ["created_at", "2022-04-30 15:05:31.746232"], ["updated_at", "2022-04-30 15:05:31.746232"]]
---
      def create
        @record = current_user.records.build(record_params)

        if @record.save

UPDATE "records" SET "title" = ?, "updated_at" = ? WHERE "records"."id" = ?  [["title", "DU HAST"], ["updated_at", "2022-04-30 15:12:28.608800"], ["id", 3]]
---
      def update
        if @record.update(record_params)

DELETE FROM "records" WHERE "records"."id" = ?  [["id", 2]]
---
      def destroy
        @record.destroy

SELECT "records".* FROM "records" WHERE "records"."user_id" = ? AND "records"."id" = ? LIMIT ?  [["user_id", 3], ["id", 2], ["LIMIT", 1]]
---
      def set_record
        @record = current_user.records.find(params[:id])