app/controllers/api/v1/users_controller.rb

      def user_includes
        { records: current_user.records.all,
          users: User.all }
---
SELECT "records".* FROM "records" WHERE "records"."user_id" = ?  [["user_id", 3]]
SELECT "users".* FROM "users"