app/controllers/api/v1/users_controller.rb

UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "email"], ["updated_at", "2022-05-11 19:32:58.174582"], ["id", 1]]
---
      def update
        if @user.update(user_params)