app/controllers/signin_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "ee"], ["LIMIT", 1]]
---
  def create
    user = User.find_by!(email: params[:email])