app/models/user.rb

SELECT "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ?  [["user_id", 12]]
---
  def assign_default_role
    self.add_role(:newuser) if self.roles.blank?